app/views/admin/_home_page.html.erb

SELECT `app_parameters`.* FROM `app_parameters`
---
  <div class="desc">
    <% AppParameter.all.each{|pa| %>