app/controllers/conversations_controller.rb

  def new
    conversation = Conversation.create_conversation(params[:conversation])
---
INSERT INTO `conversations` (`billable_time`, `billed_amount`, `client_id`, `created_at`, `end_date`, `has_been_charged`, `lawdingo_charge`, `lawyer_id`, `lawyer_rate`, `paid_to_lawyer`, `payment_params`, `start_date`, `updated_at`) VALUES (31, 1.0, 2, '2011-10-21 12:15:25', '2011-10-21 12:46:53', 0, 1.0, 1, 0.0, 1, NULL, '2011-10-21 12:15:25', '2011-10-21 12:15:25')

  def review
    begin
      @conversation = Conversation.find params[:conversation_id]
---
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 1 LIMIT 1

  def summary
    begin
      @conversation = Conversation.find params[:conversation_id]
---
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 1 LIMIT 1