app/controllers/pages_controller.rb

  def show
    begin
      @page = Page.find_by_name params[:name]
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`name` = 'about' LIMIT 1