app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    begin
      @user = User.find params[:id]

INSERT INTO `users` (`address`, `alma_maters`, `balance`, `bar_ids`, `bar_memberships`, `created_at`, `email`, `full_name`, `hashed_password`, `is_approved`, `is_online`, `last_login`, `last_online`, `law_firm`, `law_school`, `payment_email`, `personal_tagline`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `photo_updated_at`, `practice_areas`, `rate`, `skype`, `undergraduate_school`, `updated_at`, `user_type`) VALUES (NULL, NULL, 0.0, NULL, NULL, '2011-10-16 08:49:44', 'nav1982@gmail.com', 'Nav Raj', '7c4a8d09ca3762af61e59520943dc26494f8941b', 0, 0, NULL, NULL, NULL, NULL, NULL, 'Test for User', 'image/jpeg', 'lawyer.jpeg', 7639, '2011-10-16 08:49:43', NULL, 0.0, NULL, NULL, '2011-10-16 08:49:44', 'CLIENT')
---
  def create
    redirect_to root_path and return if current_user
    user_type = params[:user_type]
    @user     = user_type == User::LAWYER_TYPE ? Lawyer.new(params[:lawyer]) : User.new(params[:user])
    @user.user_type = user_type

    if @user.user_type == User::LAWYER_TYPE
      # per minute rate from hourly
      @user.rate = (params[:lawyer][:rate].to_f / 60.to_f).round(2)
    end

    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    begin
      @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `photo_file_name` = 'favicon.ico', `photo_content_type` = 'image/vnd.microsoft.icon', `photo_file_size` = 4406, `photo_updated_at` = '2011-10-20 10:20:36', `payment_email` = 'bobby@hotmail.com', `updated_at` = '2011-10-20 10:20:36' WHERE `users`.`id` = 7
---
  def update
    @user = User.find(params[:id])
    if @user.is_lawyer?
      @user  = Lawyer.find(@user.id)
      status = @user.update_attributes(params[:lawyer])

UPDATE `users` SET `has_payment_info` = 1, `updated_at` = '2011-10-21 12:15:14' WHERE `users`.`id` = 5
---
  def payment_info
#    redirect_to root_path and return if current_user.card_detail
    token = params[:stripe_card_token]
    if request.method == "POST"
      customer = Stripe::Customer.create(
        :card => token,
        :description => current_user.email
      )
      if current_user.stripe_customer_token.present?
        curl_cmd = "curl https://api.stripe.com/v1/customers/#{current_user.stripe_customer_token} \
              -u #{Stripe.api_key}: -X DELETE"
        system curl_cmd
      end
      if customer && current_user.save_stripe_customer_id(customer.id)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
---
  def chat_session
    #redirect_to card_detail_path and return unless current_user.card_detail
    begin
      @current_user = current_user

      if current_user.user_type!='LAWYER'
        lawyer = User.find params[:user_id]

SELECT `app_parameters`.* FROM `app_parameters` WHERE `app_parameters`.`id` = 2 LIMIT 1
UPDATE `app_parameters` SET `value` = 'Legal advice, over video chat, pay by the minute', `updated_at` = '2011-10-20 07:47:33' WHERE `app_parameters`.`id` = 2
---
  def update_parameter
    begin
      pobj    = AppParameter.find params[:id]
    rescue
      pobj    = nil
    end
    # pvalue = params[:value]
    # pvalue = pvalue.blank? ? pobj.value : pvalue.strip

    pvalue = ""
    pvalue = params[:value].to_s if params[:value].present?

    if pobj
      pobj.update_attribute(:value, pvalue)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1
UPDATE `users` SET `peer_id` = 'sdfsdfsdf2342332', `updated_at` = '2011-11-02 09:43:49' WHERE `users`.`id` = 5
---
  def register_for_videochat
    u_id = params[:username] if params[:username]
    peer_id = params[:identity] if params[:identity]
    @user = User.find(u_id)
    @user.peer_id = peer_id
    if @user.save

SELECT `users`.* FROM `users` WHERE (user_type = 'LAWYER' and is_approved is true)
---
  def find_remote_user_for_videochat
    remote_user_id = params[:friends] if params[:friends]
    begin
      @user = User.find(remote_user_id)